In [2]:
import pandas as pd
import sqlite3

In [3]:
# Conectamos con la base de datos chinook.db
connection = sqlite3.connect("data/my_database.db")

# Obtenemos un cursor que utilizaremos para hacer las queries
crsr = connection.cursor()

In [11]:
res = crsr.execute("SELECT name FROM sqlite_master WHERE type='table'")
for name in res:
    print(name[0])

In [5]:
# Con esta funci√≥n leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

    # Ejecuta la query
    crsr.execute(query)

    # Almacena los datos de la query 
    ans = crsr.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

In [12]:
query = '''
CREATE TABLE cervezas (
    CodC VARCHAR(2),
    Envase VARCHAR(32),
    Capacidad FLOAT(2),
    Stock INT(5),
    PRIMARY KEY (CodC)
)
'''

crsr.execute(query)

In [13]:
res = crsr.execute("SELECT name FROM sqlite_master WHERE type='table'")
for name in res:
    print(name[0])

cervezas

In [14]:
query = '''
SELECT * FROM cervezas 
'''
sql_query(query)

Empty DataFrame
Columns: [CodC, Envase, Capacidad, Stock]
Index: []

In [10]:
# query = '''
# DROP TABLE cervezas 
# '''
# crsr.execute(query)

In [15]:
query = '''
INSERT INTO Cervezas (CodC, Envase, Capacidad, Stock)
VALUES ('01','Botella',0.2,3600)
'''
crsr.execute(query)

In [16]:
query = '''
SELECT * FROM cervezas 
'''
sql_query(query)

  CodC   Envase  Capacidad  Stock
0   01  Botella        0.2   3600

In [17]:
query = '''
INSERT INTO Cervezas VALUES ('02','Botella',0.33,1200)
'''
crsr.execute(query)

In [18]:
query = '''
INSERT INTO Cervezas VALUES ('03','Lata',0.33,2400),
('04','Botella',1,288),
('05','Barril',60,30)
'''
crsr.execute(query)

In [19]:
query = '''
SELECT * FROM cervezas 
'''
sql_query(query)

  CodC   Envase  Capacidad  Stock
0   01  Botella       0.20   3600
1   02  Botella       0.33   1200
2   03     Lata       0.33   2400
3   04  Botella       1.00    288
4   05   Barril      60.00     30

## DataFame a BD sql

[pandas.DataFrame.to_sql](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_sql.html)

In [20]:
query = '''
SELECT * FROM cervezas 
'''
sql_query(query)

  CodC   Envase  Capacidad  Stock
0   01  Botella       0.20   3600
1   02  Botella       0.33   1200
2   03     Lata       0.33   2400
3   04  Botella       1.00    288
4   05   Barril      60.00     30

In [21]:
query = '''
UPDATE cervezas
SET Stock = 5000, Capacidad = 0.25
WHERE CodC='02';
'''
crsr.execute(query)

In [22]:
query = '''
SELECT * FROM cervezas 
'''
sql_query(query)

  CodC   Envase  Capacidad  Stock
0   01  Botella       0.20   3600
1   02  Botella       0.25   5000
2   03     Lata       0.33   2400
3   04  Botella       1.00    288
4   05   Barril      60.00     30

In [23]:
query = '''
DELETE FROM cervezas WHERE CodC='05';
'''
crsr.execute(query)

In [26]:
query = '''
SELECT * FROM cervezas
'''
sql_query(query)

  CodC   Envase  Capacidad  Stock
0   01  Botella       0.20   3600
1   02  Botella       0.25   5000
2   03     Lata       0.33   2400
3   04  Botella       1.00    288

## SUBQUERIES

In [27]:
query = '''
SELECT * FROM (SELECT * FROM Cervezas WHERE Envase="Botella")
'''
sql_query(query)

  CodC   Envase  Capacidad  Stock
0   01  Botella       0.20   3600
1   02  Botella       0.25   5000
2   04  Botella       1.00    288

In [28]:
# ATENCI√ìN! Al terminar hay que cerrar la conexi√≥n a la DB para que se guarden los cambios!!!!!!
connection.commit()
connection.close()